Revit 2027 API
Document.PathName Property
 The fully qualified path of the document's disk file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PathName { get; }
Public ReadOnly Property PathName As String
	Get
public:
property String^ PathName {
	String^ get ();
}
member PathName : string with get
Property Value
String
Remarks
 This string is empty if the project has not been saved or does not have a disk file associated with it yet. Note that the pathname will be empty if a document is detached. See IsDetached.
Example
string docPathName = document.PathName;
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace